# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

N = int(input("Введите трехзначное число N: "))
n1 = N // 100
a = N % 100
n2 = a // 10
n3 = N % 10
# print(n1)
# print(a)
# print(n2)
# print(n3)
print("Сумма цифр трехзначного числа:", n1 + n2 + n3)


